{
  "banner": {
    "welcome": "Welcome to my portfolio",
    "iam": "Hi, I`m Roms",
    "title": "Software Engineer",
    "description": "Results-Driven full-stack developer with hands-on experience in React, Nodejs and MongoDB. Skilled in translating\nbusiness requirements into scalable solutions. Building reusable components, and leading development team. Adept\nat code reviews, unit testing, and deployment processes, ensuring high-quality deliveries and smooth project\nexecution.",
    "contact": {
      "email": "rcena.dev@gmail.com",
      "phone": "09754120343",
      "location": "Remote (WFH)",
      "shift": "Reg/Mid Shift (PH Time)"
    }
  },
  "introduction": {
    "heading": "Professional Introduction",
    "paragraphs": [
      "I'm a Software Engineer specializing in building fast, reliable, and delightful web applications.",
      "I enjoy crafting clean, scalable frontends with React/Next.js and thoughtful UX, and I collaborate closely with teams to ship features that matter."
    ],
    "highlights": [
      "Frontend: React, Next.js, Nx, TypeScript, Tailwind Css, Mantine UI, Redux/RTQ, Storybook, Jest, Playwright,",
      "Backend: Node.js, Express, NestJs, GraphQL, MongoDB, Prisma ORM, MySQL, DynamoDB, Firebase RealTime Database, Rest API",
      "Animation/UI: Framer Motion, ShadCn/ui",
      "Practices: Performance, Accessibility, Reusability"
    ]
  },
  "experiences": [
    {
      "company": "8C DigIT",
      "role": "Senior Software Engineer",
      "period": "Jan 2023 — August 2025",
      "description": "Led full-stack development with React (Mantine UI), Node.js, and MongoDB, delivering scalable, tested, and seamlessly deployed applications.",
      "responsibilities": [
        "Reviewed and analyzed Functional Requirements Documents to produce accurate estimates and implementation plans.",
        "Designed modular, reusable components to enhance scalability, maintainability and code quality.",
        "Developed and executed unit tests to ensure robust functionality and minimize regressions."
      ]
    },
    {
      "company": "StarTechUp Inc",
      "role": "Full‑Stack Developer",
      "period": "Sept 2022 — Feb. 2023",
      "description": "Contributed to a mobile-first social media app using React (TypeScript) and Node.js, enhancing UI/UX, implementing reports, and improving scalability and performance.",
      "responsibilities": [
        "Helped standardize UI components and enhance UX/UI for a consistent, responsive user experience.",
        "Assisted in reviewing designs and implementing graph-based reports to track key metrics and inform decisions.",
        "Supported improving features for greater scalability, performance, and maintainability."
      ]
    },
    {
      "company": "Accenture Inc. PH",
      "role": "Application Developer",
      "period": "Feb. 2021 — Sept. 2022",
      "description": "Developed and maintained responsive front-end features for e-commerce and insurance websites using React (TypeScript), integrating APIs, optimizing designs, and ensuring best practices across the development lifecycle.",
      "responsibilities": [
        "Contributed to daily stand-ups, conducted code reviews, and upheld best practices across the development lifecycle.",
        "Translated designs into optimized, production-ready code in close collaboration with architects and the team.",
        "Integrated RESTful APIs, third-party services, and wrote unit tests to ensure a seamless, scalable user experience."
      ]
    },
    {
      "company": "Desk BPO Services (formerly Deskma)",
      "role": "Full-stack developer",
      "period": "Apr. 2019 — Feb. 2021",
      "responsibilities": [
        "Designed and built responsive, mobile-optimized websites and interfaces using React.js and TYPO3, ensuring a seamless user experience.",
        "Partnered with backend developers (Laravel), designers, and marketing teams to maintain brand consistency and align features with business goals.",
        "Integrated RESTful APIs and supported backend teams by troubleshooting and enhancing data flow across the stack.",
        "Developed, deployed, and refactored scalable, maintainable components to boost performance, reliability, and user engagement."
      ]
    },
    {
      "company": "Jinisys Software Inc.",
      "role": "Software Engineer",
      "period": "Feb. 2018 — Apr. 2019",
      "responsibilities": [
        "Built and maintained a C# WinForms desktop app with a focus on clean, maintainable code.",
        "Worked closely with cross-functional teams to capture requirements and deliver new features.",
        "Optimized MySQL queries and schema for efficient data handling and performance.",
        "Reviewed code and provided constructive feedback to ensure high-quality, scalable solutions."
      ]
    },
    {
      "company": "RD Pawnshop Inc.",
      "role": "Software Engineer",
      "period": "Nov 2017 — Feb. 2018",
      "responsibilities": [
        "Refactored and maintained the in-house C# WinForms desktop application to boost performance and reliability.",
        "Conducted dry-run testing and validated functionality to ensure data accuracy and efficiency."
      ]

    },
    {
      "company": "Wizard I.T. Systems Inc.",
      "role": "Web Developer",
      "period": "Feb. 2016 — Jul. 2017",
      "description": "Shipped UI components and design systems with React, Tailwind, and Storybook; collaborated closely with design and product teams.",
      "responsibilities": [
        "Designed and built front-end applications using native HTML, Bootstrap, CSS, and vanilla JavaScript, with reusable components and client-side rendering via AJAX.",
        "Developed PHP server-side logic with MySQL (including stored procedures) to support dynamic content and efficient data handling."
      ]
    }
  ],
  "techStack": [
    {
      "label": "Core",
      "items": [
        "TypeScript",
        "JavaScript",
        "Node.js"
      ]
    },
    {
      "label": "Frontend",
      "items": [
        "React",
        "Next.js",
        "Tailwind CSS",
        "ShadCN/ui",
        "Framer Motion",
        "Redux/RTQ",
        "AntDesign",
        "MaterialUI",
        "Styled-Components"
      ]
    },
    {
      "label": "Backend & APIs",
      "items": [
        "Express",
        "NodeJs",
        "NestJs",
        "GraphQL",
        "JWT/Auth",
        "Rest API"
      ]
    },
    {
      "label": "Databases",
      "items": [
        "MongoDB",
        "Prisma ORM",
        "MySQL",
        "MSSQL",
        "PostGreSql",
        "DynamoDB",
        "Firebase RealTime Database"
      ]
    },
    {
      "label": "Tools",
      "items": [
        "Git",
        "Nx",
        "Vite",
        "Jest",
        "Playwright",
        "Github",
        "GitLab",
        "BitBucket"
      ]
    }
  ],
  "educations": [
    {
      "school": "Saint Michael College of Caraga",
      "degree": "B.S. in Computer Science",
      "period": "2011 — 2014",
      "description": ""
    },
    {
      "school": "Saint Michael College of Caraga",
      "degree": "Computer Programming NC-IV - Vocational Course",
      "period": "2009 — 2011",
      "description": ""
    }
  ],
  "projects": {
    "description": "Hands-on experience in full-cycle project development, from planning and implementation to optimization and deployment--across diverse business solutions.",
    "projects": [
      {
        "name": "Marketing Sites",
        "description": "Dynamic, mobile-optimized marketing platforms that highlight brand identity, promotions, and customer engagement for Red Ribbon, Burger King and Greenwich.",
        "technologies": [
          "React",
          "NextJs",
          "Nx",
          "Contentful",
          "Tailwind CSS",
          "Redux/RTQ",
          "Zustand"
        ]
      },
      {
        "name": "Order Manager",
        "description": "An intuitive Order Manager that simplifies order processing, inventory updates, and customer coordination in one dashboard.",
        "technologies": [
          "React",
          "NextJs",
          "Tailwind CSS",
          "Redux/RTQ",
          "Zustand"
        ]
      },
      {
        "name": "Loan Management System",
        "description": "A Loan Management System that streamlines loan applications, approvals, and tracking to improve efficiency and user experience.",
        "technologies": [
          "React",
          "NextJs",
          "Mantine UI",
          "NodeJs/Express",
          "Tailwind CSS",
          "MongoDB"
        ]
      },
      {
        "name": "Social Media Platform (Feety)",
        "description": "A mobile-first social media platform for foot enthusiasts to connect, share, and engage through an intuitive and responsive experience.",
        "technologies": [
          "React",
          "Tailwind CSS",
          "NodeJs/Express",
          "MongoDB"
        ]
      },
      {
        "name": "eCommerce Website",
        "description": "An eCommerce website for wine that streamlines online sales, enhances customer experience, and simplifies product discovery and purchase.",
        "technologies": [
          "React",
          "TypeScript",
          "Tailwind CSS",
          "Contentful",
          "AWS/DynamoDB"
        ]
      },
      {
        "name": "Health Insurance Web Application",
        "description": "A health insurance website that simplifies policy browsing, enrollment, and management for an accessible and user-friendly experience.",
        "technologies": [
          "React",
          "NextJs",
          "Prisma ORM",
          "NestJs",
          "TypeScript",
          "Tailwind CSS"
        ]
      },
      {
        "name": "CRM System",
        "description": "A Customer Relationship Management (CRM) system that helps businesses manage client interactions, track leads, and streamline sales processes for better customer engagement.",
        "technologies": [
          "React",
          "Laravel",
          "Typo3",
          "PHP",
          "MySQL"
        ]
      },
      {
        "name": "Social Media Platform (Dougly)",
        "description": "A social media platform for dog lovers that fosters community, sharing, and engagement through an intuitive and enjoyable experience.",
        "technologies": [
          "React",
          "Laravel",
          "Typo3",
          "PHP",
          "MySQL"
        ]
      },
      {
        "name": "Simple Accounting with Inventory and POS and Time In/Out Feat.",
        "description": "A simple accounting with inventory together with POS and Employee Time logs tracking. also include the RBAC.",
        "technologies": [
          "React/NextJs",
          "Tailwind CSS",
          "MirageJs"
        ],
        "link": "https://pvt-accounting.vercel.app/"
      }
    ]
  },
  "feedbacks": [
    {
      "name": "Donniver Agnes ",
      "role": "Head of Information Technology Operations",
      "rating": 5,
      "feedback": "Great developer experience focus. Our frontend performance improved noticeably after his refactors."
    },
    {
      "name": "Jason Hinanay",
      "role": "Head of System Development",
      "rating": 5,
      "feedback": "Roms consistently delivered high‑quality features on time and communicated clearly throughout the project."
    },
    {
      "name": "Maritess Ostan",
      "role": "Team Lead for Quality Assurance",
      "rating": 5,
      "feedback": "Professional and thoughtful. Loved the attention to accessibility and details in UI interactions."
    }
  ]
}
